-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/winter/Documents/R_Projects/GGF-Conservatism/log/2023-04-02
> /02_description-statistics_2023.04.02-10.04.22.log
  log type:  text
 opened on:   2 Apr 2023, 10:04:22

. 
end of do-file
. 
. // Read main-data
. use "processed/intermediate/main_data.dta", clear
. 
. // Winsorize Sample
. #delimit ;
delimiter now ;
. winsor2 EPS_P Size Lev GDP_p Age MHRatio CG INS SuperINS RegionFin OverInvest
>  StrategyScore, 
>     cuts(1 99) by(Year) replace;
. #delimit cr
delimiter now cr
. 
. 
. // Description Statistics ---------------------------------------------------
> -
. // Filepath for tables
. global table_path "results/tables"
. 
. // Variables Summary
. #delimit ;
delimiter now ;
. logout, save("$table_path/01_varis-summary.doc") word replace:
>     tabstat EPS_P DR Ret GGF 
>     Size Lev MHRatio Age GDP_p 
>     CG INS SuperINS RegionFin OverInvest StrategyScore,
>     s(N mean sd min p25 p50 p75 max) c(s)
>     ;

